---
kind: method
id: M:Autodesk.Revit.DB.Architecture.SiteSubRegion.Dispose
source: html/2591e1a5-1dc1-0381-4a5a-3842591b8986.htm
---
# Autodesk.Revit.DB.Architecture.SiteSubRegion.Dispose Method

Releases all resources used by the SiteSubRegion

## Syntax (C#)
```csharp
public void Dispose()
```